BaskInNight/xiaojing-esp32-firmware/test_apps/boot_smoke_d_no_psram/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB QIO 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# CPU 160MHz
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_160=y

# NO PSRAM — this is the key isolation variable
CONFIG_SPIRAM=n

# Disable BLE
CONFIG_BT_ENABLED=n

# Minimal stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Disable watchdog for clean baseline
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_INT_WDT=n
CONFIG_BOOTLOADER_WDT_ENABLE=n

# Disable coredump
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
